In [1]:
import pandas as pd
import numpy as np

In [2]:
List1=[x for x in range(1,21) if x%2==0]

In [3]:
List2=pd.Series([y for y in range(3,31,3)])

In [4]:
List3=pd.Series([z for z in range(1,31,2) if z%3!=0])

In [5]:
List3

0     1
1     5
2     7
3    11
4    13
5    17
6    19
7    23
8    25
9    29
dtype: int64

In [10]:
Mytable=pd.DataFrame([List1,List2,List3])

In [11]:
Mytable

   0  1  2   3   4   5   6   7   8   9
0  2  4  6   8  10  12  14  16  18  20
1  3  6  9  12  15  18  21  24  27  30
2  1  5  7  11  13  17  19  23  25  29

In [26]:
mylist=["yellow","red","green","yellow","red","yellow"]
mylist2=["van","truck","car","van","18wheeler","car"]
mylist

['yellow', 'red', 'green', 'yellow', 'red', 'yellow']

In [27]:
Mytable=pd.DataFrame({"Color":mylist,"Vehicle":mylist2})
Mytable

    Color    Vehicle
0  yellow        van
1     red      truck
2   green        car
3  yellow        van
4     red  18wheeler
5  yellow        car

In [15]:
Mytable.duplicated("Color")

0    False
1    False
2    False
3     True
4     True
5     True
dtype: bool

In [12]:
Mytable.duplicated("Vehicle")

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [17]:
Mytable.drop_duplicates("Vehicle")

    Color    Vehicle
0  yellow        van
1     red      truck
2   green        car
4     red  18wheeler

In [18]:
Mytable.drop_duplicates("Color")

    Color Vehicle
0  yellow     van
1     red   truck
2   green     car

In [28]:
Mytable.drop_duplicates(["Color","Vehicle"])

    Color    Vehicle
0  yellow        van
1     red      truck
2   green        car
4     red  18wheeler
5  yellow        car

In [29]:
Mytable.drop_duplicates(keep=False)

    Color    Vehicle
1     red      truck
2   green        car
4     red  18wheeler
5  yellow        car

In [32]:
pd.crosstab(Mytable["Color"],Mytable["Vehicle"],margins=True)

Vehicle  18wheeler  car  truck  van  All
Color
green            0    1      0    0    1
red              1    0      1    0    2
yellow           0    1      0    2    3
All              1    2      1    2    6